Autodesk.Revit.DB.Architecture.StairsPathLineShapeAtCorner
The options for the line shape of a stairs path at a corner.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPathLineShapeAtCorner.Curved
The line shape of stairs path at the corner is curved.

Autodesk.Revit.DB.Architecture.StairsPathLineShapeAtCorner.Straight
The line shape of stairs path at the corner is straight.